Revit 2027 API
WallSweepInfo(WallSweepType, Boolean) Constructor
 Constructs a new WallSweepInfo instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallSweepInfo(
	WallSweepType type,
	bool vertical
)
Public Sub New (
	type As WallSweepType,
	vertical As Boolean
)
public:
WallSweepInfo(
	WallSweepType type,
	bool vertical
)
new :
        type : WallSweepType *
        vertical : bool -> WallSweepInfo
Parameters
type WallSweepType
 The type of the WallSweepInfo instance.
vertical Boolean
 True to construct a vertical wall sweep, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallSweepInfo Class
WallSweepInfo Overload
Autodesk.Revit.DB Namespace